Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/housing/owning_a_home/mortgage_arrears/mortgage_arrears_resolution_process.html.txt.tmx
Source language: en
Languages: ga

source: Mortgage Arrears Resolution Process (MARP)
ga: Próiseas Réitigh do Riaráistí Morgáiste (MARP)

source: The Central Bank's Code of Conduct on Mortgage Arrears (CCMA) (pdf) sets out the framework that lenders must use when dealing with borrowers in mortgage arrears or in pre-arrears
ga: Leagann an Cód Iompraíochta ar Riaráistí Morgáiste (CIRM) (pdf) amach an creatlach nach mór d’iasachtóirí a úsáid agus iad ag déileáil le hiasachtaithe i riaráistí morgáiste nó i réamh-riaráistí

source: It requires lenders to handle all such cases sympathetically and positively, with the objective at all times of helping people to meet their mortgage obligations
ga: Éilíonn sé ar iasachtóirí cásanna den tsórt sin go léir a láimhseáil go tuisceanach agus go dearfach, agus é mar chuspóir ag gach tráth cabhrú le daoine a gcuid oibleagáidí morgáiste a chomhlíonadh

source: Under the CCMA, lenders must operate a Mortgage Arrears Resolution Process (MARP) when dealing with arrears and pre-arrears customers
ga: De réir an CIRM, ní mór d’iasachtóirí Próiseas Réitigh do Riaráistí Morgáiste (MARP) a úsáid agus iad ag déileáil le custaiméirí riaráiste agus réamh-riaráistí

source: The CCMA was revised in 2013 and now contains a detailed definition of what constitutes 'not co-operating' with the lender and strong provisions on what happens if you are declared 'not co-operating' – which can include immediate commencement of repossession proceedings
ga: Tugadh an ceanglas seo isteach in Eanáir 2011 agus athraíodh na rialacha faoin CIRM, a tháinig i bhfeidhm in Iúil 2013

source: The 4 steps of the MARP are covered in detail below
ga: Tugtar sonraí cuimsitheacha ar na 4 chéim den PRRM thíos

source: They are: communication; financial information; assessment; and resolution
ga: Is iad: cumarsáid; faisnéis airgeadais; measúnú agus réiteach

source: There is also an appeals process under the CCMA, but this is outside the MARP
ga: Ta próiseas achomhairc ann chomh maith faoin CIRM, ach tá seo lasmuigh de scóip an PRRM anois

source: Read more in our document about the CCMA
ga: Má baineadh leas as na céimeanna seo cheana féin, agus má bheartaíonn an t-iasachtóir do theach a athshealbhú, ní mór dóibh cloí le rialacha an CIRM a rialaíonn imeachtaí athshealbhaithe

source: Under the personal insolvency system, people applying for a Personal Insolvency Arrangement must declare that they have co-operated with their mortgage lender under the MARP for at least 6 months and have been unable to agree an alternative repayment arrangement
ga: Is féidir leat níos mó a léamh faoin CIRM anseo agus i dtreoir do thomhaltóirí (pdf) an Bhainc Cheannais

source: Getting help from MABS
ga: An ceanglas go dtugtar faoin PRRM

source: The Money Advice and Budgeting Service (MABS) can help you to work through the steps of the MARP
ga: Ón 18 Meitheamh 2012 amach, níor mhór do dhaoine a raibh iarratas á dhéanamh acu ar Fhorlíonadh Ús Morgáiste (FÚM) a léiriú gur bhain siad socrú eile íocaíochta amach lena n-iasachtóir ar feadh 12 mhí ar a laghad faoin PRRM

source: It has a Dedicated Mortgage Arrears service in over 20 locations and a court mentor service, in collaboration with the Insolvency Service of Ireland (ISI), to assist debtors faced with court proceedings. Read more about these services
ga: (Tá an scéim FÚM dúnta d'iarrthóirí nua ón 1 Eanáir 2014.) Is féidir leat níos mó a léamh faoi seo inár gcáipéis ar Fhorlíonadh Ús Morgáiste

source: MABS is also centrally involved in a new aid and advice scheme for people in serious mortgage arrears, as part of Abhaile, the national Mortgage Arrears Resolution Service
ga: Is féidir leat níos mó a léamh faoi seo inár gcáipéis ar Shocruithe um Dhócmhainneacht Phearsanta

source: A mortgage arrears problem arises as soon as you fail to make a full mortgage repayment or only make a partial mortgage repayment on the date it is due
ga: Éiríonn fadhb riaráistí morgáiste chomh luath agus a theipeann ort aisíocaíocht iomlán a dhéanamh ar an dáta a bhfuil sí dlite, nó má dhéanann tú íocaíocht pháirteach ar an dáta seo

source: If the arrears remain outstanding 31 days from this date, the lender must inform you in writing of the status of the mortgage account
ga: Má fhanann na riaráistí gan íoc ar feadh 31 lá ón dáta seo, ní mór don iasachtóir stádas an chuntais mhorgáiste a chur in iúl duit i scríbhinn

source: This letter must include full details of the payment(s) missed and the total amount now in arrears
ga: Ní mór an litir seo sonraí iomlána na híocaíochta/na n-íocaíochtaí a chailleadh agus an méid iomlán atá i riaráiste anois

source: It must also explain that your arrears are now being dealt with under the MARP; the importance of co-operating with the lender; the consequences of non-cooperation; and the impact of missed repayments or repossession on your credit rating
ga: Ní mór dó freisin míniú chomh maith go bhfuil do riaráistí á láimhseáil anois faoin MARP; an tábhacht a bhaineann le comhoibriú leis an iasachtóir; na hiarmhairtí a bhaineann le neamhchomhoibriú; agus an tionchar a behidh ag aisíocaíochtaí caillte nó athshealbhú tí ar do rátáil creidmheasa

source: The lender must also send you an information booklet including details on the MARP, relevant contact points for arrears issues and details of websites with mortgage arrears information, such as mabs.ie and keepingyourhome.ie
ga: Ní mór don iasachtóir leabhrán eolais a sheoladh chugat freisin, ina dtugtar mionsonraí ar an MARP, pointí teagmhála ábhartha maidir le saincheisteanna riaráistí agus sonraí na suíomh gréasáin le faisnéis ar riaráistí morgáiste, ar nós mabs.ie agus keepingyourhome.ie

source: (You must also get this if you are in pre-arrears.)
ga: (Ní mór duit an leabhrán seo a fháil freisin má tá tú i réamh-riaráistí.)

source: For as long as you are in arrears, the lender must give you a written update of the status of your account every 3 months
ga: Chomh fada is atá tú i riaráiste, ní mór don iasachtóir nuashonrú a thabhairt duit i scríbhinn ar stádas do chuntais gach 3 mhí

source: If an alternative repayment arrangement has not been set up, and you miss a third repayment (full or partial), the lender must tell you the following in writing:
ga: Mura bhfuil socrú aisíoca malartach curtha ar bun, agus má cailleann tú an tríú aisíocaíocht (iomlán nó páirteach), ní mór don iasachtóir an méid seo a leanas a insint duit i scríbhinn:

source: • The potential for legal proceedings and loss of your property, and an estimate of the costs to you of such proceedings
ga: • An poitéinseal le haghaidh imeachtaí dlíthiúla agus caillteanais do mhaoine, agus meastachán ar an gcostas a bhainfeadh le himeachtaí den chinéal seo ort

source: • The importance of taking independent advice from MABS or an appropriate alternative
ga: • An tábhacht a bhaineann le comhairle neamhspleách a fháil ón tSeirbhís Bhuiséadta agus Comhairle Airgid (MABS) nó rogha eile cuí

source: • That even if your property is sold, you will remain liable for any outstanding debt, including any accrued interest, charges, legal, selling and other related costs
ga: • Fiú amháin má dhíoltar do mhaoin, beidh tú fós faoi dhliteanas aon fhiach nár íoc tú, lena n-áirítear aon ús fabhraithe, muirir, dlíthiúil, díol agus costais bhainteacha eile

source: Under the CCMA, each lender’s Board must agree a communications policy, which ensures that the level of communications with borrowers is proportionate and not excessive; communications are not aggressive, intimidating or harassing; borrowers get enough time to complete agreed actions (with help if needed) before any further communication; and steps are taken to agree future communications
ga: Faoin CIRM, ní mór do Bhord gach iasachtóra comhaontú a dhéanamh ar bheartas cumarsáide, a chinntíonn go bhfuil an leibhéal cumarsáide le hiasachtaithe i gcomhréir agus nach bhfuil sé iomarcach; nach bhfuil an chumarsáid ionsaitheach, imeaglach ná ciapthach; go dtugtar dóthain ama d’iasachtaithe chun na gníomhartha lenar comhaontaíodh a chríochnú (agus go dtugtar cabhair dóibh, más gá) sula ndéantar aon chumarsáid bhreise; agus go dtéitear i mbun beart chun comhaontú a dhéanamh ar chumarsáid amach anseo

source: Communications must not be unnecessarily frequent
ga: Níor cheart go ndéanfaí an chumarsáid “chomh minic sin nach bhfuil gá leis”

source: The lender may make an unsolicited visit to your home only if other attempts to contact you have failed and you are about to be classified as not co-operating
ga: Féadfaidh an t-iasachtóir cuairt a thabhairt ar do theach gan aon fhógra a thabhairt duit má theip air/uirthi agus iarrachtaí á ndéanamh aige/aici teagmháil a dhéanamh leat agus má táthar ar tí thú a rangú amhail gan bheith ag comhoibriú

source: You must get at least 5 business days’ notice and you can opt to meet in the lender’s office instead
ga: Ní mór go dtabharfar ar a laghad fógra cúig lá gnó duit agus féadfaidh tú a roghnú chun casadh leis an iasachtóir ina (h)oifig ina ionad sin

source: You can choose to have a third party with you
ga: Féadfaidh tú a roghnú go rachaidh tríú páirtí i gcuideachta leat

source: The lender’s letter announcing the visit must explain the implications of not co-operating
ga: Ní mór go míneofar i litir an iasachtóra ina bhfógraítear an chuairt na himpleachtaí a bheidh i gceist mura gcomhoibríonn tú

source: Lenders must provide a standard financial statement to obtain financial information from a borrower in arrears or in pre-arrears, so that they can assess your financial position and identify the best course of action
ga: Ní mór d’iasachtóirí ráiteas airgeadais caighdeánach a sholáthar chun faisnéis airgeadais a fháil ó iasachtaí i riaráistí nó i réamh-riaráistí, ionas gur féidir leo do staid airgeadais a mheas agus an cúrsa gnímh is fearr a aithint

source: The Central Bank has developed an industry standard format (pdf) for the standard financial statement (SFS)
ga: Dhéan an Banc Ceannais forbairt ar fhormáid tionscalchaighdeánach (pdf) le haghaidh an gnáthráiteas airgeadais (SFS)

source: All lenders must use this SFS
ga: Tá ar gach iasachtóir an SFS a úsáid

source: The Central Bank has a consumer guide (pdf) to completing an SFS
ga: Tá treoirleabhar (pdf) foilsithe freisin chun cabhrú le daoine an SFS a chomhlíonadh

source: When providing the financial statement, the lender must ensure that you understand the MARP process
ga: Agus an SFS á chur ar fáil, ní mór don iasachtóir a chinntiú go dtuigeann tú an próiseas MARP

source: It must offer to help you to complete the SFS and mention sources of independent advice, such as MABS
ga: Ní mór go ndéanann an t-iasachtóir cabhair a thairiscint duit chun an SFS a chomhlánú agus foinsí comhairle neamhspleáiche a lua, ar nós an MABS

source: It must give you enough time to assemble the information and complete the SFS, and must give you a copy of the completed statement
ga: Ní mór dóibh dóthain ama a thabhairt duit chun an fhaisnéis a bhailiú agus chun an SFS a chomhlánú, agus ní mór dóibh cóip den ráiteas comhlánaithe a thabhairt duit

source: You may be required to provide supporting documentation to verify the information in the SFS
ga: Ní mór don iasachtóir an SFS comhlánaithe a thabhairt dá nAonad Tacaíochta Riaráistí (ATR) lena mheasúnú

source: The lender must pass the completed SFS to its Arrears Support Unit (ASU) for assessment
ga: B’fhéidir go n-iarrfar ort cáipéisíocht tacaíochta a sholáthar chun an fhaisnéis san SFS a dhearbhú

source: The lender’s ASU must assess the completed SFS in a timely manner and examine your case on its individual merits
ga: Ní mór ATR an iasachtóra measúnú a dhéanamh ar an SFS comhlánaithe ar bhealach tráthúil agus scrúdú a dhéanamh ar do chás ar bhonn a fhiúntais aonair

source: The ASU must base its assessment of your case on your full circumstances
ga: Ní mór don ATR a mheasúnú ar do chás a bhunú ar do chúinsí iomlána

source: These include your personal circumstances; overall indebtedness; information provided in the standard financial statement; current repayment capacity; and previous payment history
ga: Ina measc seo tá do chúinsí pearsanta; féichiúnas iomlán; faisnéis dá bhforáiltear san SFS; acmhainn aisíoca atá ann faoi láthair; agus stair íocaíochta roimhe seo

source: Before completing the assessment, it may agree a temporary alternative repayment arrangement if a delay would make your situation worse
ga: Sula gcomhlánaítear an measúnú, d’fhéadfaidís socrú sealadach íocaíochta eile a chomhaontú dá bhfágfaí do chás ní ba mheasa mar gheall ar mhoill

source: When the assessment is complete, the lender must explore all options for alternative repayment arrangements
ga: Nuair a bhíonn an measúnú críochnaithe, ní mór don iasachtóir na roghanna go léir a fhiosrú le haghaidh socruithe aisíocaíochta eile

source: These options may include:
ga: I measc na roghanna seo, d’fhéadfadh iad seo a leanas a bheith i gceist:

source: • Paying interest only, or interest and part of the capital, for a period
ga: • Ús amháin a íoc, nó ús agus cuid den chaipiteal a íoc, ar feadh tréimhse

source: • Permanently or temporarily reducing the interest rate
ga: • An ráta úis a laghdú go buan nó go sealadach

source: • Deferring repayments (or part) for a period
ga: • Aisíocaíochtaí a iarchur (nó cuid díobh) ar feadh tréimhse

source: • Extending the mortgage term
ga: • Téarma an mhorgáiste a shíneadh

source: • Changing the type of mortgage
ga: • Saghas an mhorgáiste a athrú

source: • Adding arrears and interest to the principal
ga: • Riaráistí agus ús a shuimiú leis an bpríomhshuim

source: • Equity participation (reduction of principal, with transfer of part of your equity)
ga: • Rannpháirtíocht ghnáthscaire (an phríomhshuim a laghdú, agus cuid de do ghnáthscair a aistriú)

source: • Warehousing part of the mortgage (including through a split mortgage)
ga: • Cuid den mhorgáiste a chur faoi stóráil (lena n-áirítear trí mhorgáiste deighilte)

source: • A "deferred interest" or other voluntary scheme
ga: • “Ús iarchurtha” nó scéim dheonach eile

source: The lender may require you to change from an existing tracker mortgage to another mortgage type if it concludes that none of the options that include keeping your tracker are appropriate or sustainable for you
ga: D’fhéadfadh an t-iasachtóir iarraidh ort athrú ó mhorgáiste reatha rianúcháin go dtí saghas eile morgáiste má bhíonn sé ina chonclúid acu nach bhfuil aon cheann de na roghanna, do mhorgáiste rianúcháin a choimeád san áireamh, oiriúnach ná inmharthana duit

source: It may offer you an alternative arrangement that requires you to change from your tracker mortgage if you can afford the alternative arrangement and it is sustainable
ga: D’fhéadfaidís socrú eile a ofráil duit a iarrann ort athrú ó do mhorgáiste rianúcháin más féidir leat íoc as an socrú eile agus má tá sé inmharthana

source: Information and advice on alternative arrangements
ga: Faisnéis agus comhairle mar gheall ar shocruithe aisíoca malartacha

source: When the lender is offering an alternative repayment arrangement, they must give you a clear written explanation of the arrangement
ga: Nuair a bhíonn an t-iasachtóir ag tairiscint socrú aisíoca malartach, ní mór dóibh míniú soiléir i scríbhinn a thabhairt duit ar an socrú

source: As well as the basic details of the new repayment amount and the term of the arrangement, the lender must explain its impact on the mortgage term, the balance outstanding and the existing arrears, if any
ga: Chomh maith leis na sonraí bunúsacha ar an méid aisíoca nua agus téarma an socraithe, ní mór don iasachtóir míniú a thabhairt ar a thionchar ar théarma an mhorgáiste, an t-iarmhéid gan íoc agus na riaráistí atá ann cheana féin, más ann

source: The lender must also give details of: how interest will be applied to your mortgage loan account as a result of the arrangement; how the arrangement will be reported to the Irish Credit Bureau and the impact of this on your credit rating; and information on your right to appeal the lender’s decision, including how to submit an appeal
ga: Ní mór don iasachtóir mionsonraí a thabhairt freisin maidir le: conas ús a chur i bhfeidhm ar do chuntas iasachta morgáiste mar thoradh ar an socrú; conas a thuairisceofar an socrú chuig Biúró Creidmheasa na hÉireann agus an tionchar a bhaineann leis seo ar do rátála creidmheasa; agus eolas ar do cheart achomhairc ar chinneadh an iasachtóra lena n-áirítear conas achomharc a chur faoi bhráid

source: The lender must also advise you to take appropriate independent legal and/or financial advice
ga: Ní mór don iasachtóir comhairle a thabhairt duit chomh maith chun glacadh le comhairle dlíthiúil agus/nó airgeadais chuí neamhspleách

source: You can find out more about this in the protocol document (pdf) on keepingyourhome.ie, along with a list of participating accountants
ga: Ní mór don iasachtóir monatóireacht a dhéanamh ar an socrú ar bhonn leanúnach agus athbhreithniú foirmiúil a dhéanamh ar a oiriúnacht duit gach sé mhí ar a laghad

source: (A separate panel of accountants is being established to provide free financial advice under the Abhaile scheme.)
ga: Ní mór don athbhreithniú seo a chuimsiú seiceáil leat an bhfuil do chúinsí athraithe ó thús an socraithe nó ón athbhreithniú seo caite

source: If an alternative arrangement is agreed
ga: Seirbhís Fhaisnéise agus Chomhairle ar Riaráistí Morgáiste

source: The lender must monitor the arrangement on an ongoing basis and formally review its appropriateness for you at least every 6 months
ga: Mar chuid den tSeirbhís Fhaisnéise agus Chomhairle ar Riaráistí Morgáiste, íocfaidh d'iasachtóir €250 le cuntasóir chun comhairle neamhspleách airgeadais a thabhairt duit mar gheall ar thograí an iasachtóra

source: This review must include checking with you whether your circumstances have changed since the start of the arrangement or since the last review
ga: Roghnóidh tú féin an cuntasóir as painéal a chuimseofar ó bhaill de chomhlachais aitheanta cuntasóireachta, ina measc Institiúd na gCuntasóirí Cairte in Éirinn, Comhlachas na gCuntasóirí Cairte Deimhnithe, Institiúd na gCuntasóirí Corpraithe Poiblí in Éirinn agus Institiúd na gCuntasóirí Deimhnithe Poiblí

source: If you cease to adhere to the terms of an alternative repayment arrangement, the lender’s Arrears Support Unit (ASU) must formally review your case, including the Standard Financial Statement, immediately
ga: Féadfaidh tú teacht ar bhreis faisnéise faoi seo sa cháipéis phrótacail (pdf) ar an láithreán gréasáin keepingyourhome.ie

source: If an alternative arrangement is not agreed
ga: Mura gcomhaontaítear socrú malartach

source: It may not be possible for you and your lender to agree on an alternative repayment arrangement
ga: B’fhéidir nach mbeadh sé indéanta duit ná do d’iasachtóir comhaontú a dhéanamh ar shocrú eile aisíocaíochta

source: If the lender is not willing to offer you an alternative repayment arrangement, they must give the reasons in writing
ga: Mura bhfuil an t-iasachtóir toilteanach socrú eile aisíocaíochta a ofráil duit, ní mór dóibh na cúiseanna a lua i scríbhinn

source: If they do offer an arrangement, you may choose not to accept it
ga: Má ofrálann siad socrú eile, féadfaidh tú a roghnú gan glacadh leis

source: In both of these cases, the lender must inform you in writing about other options, including voluntary surrender, trading down or voluntary sale, and the implications for you of each option
ga: Sa dá chás seo, ní mór don iasachtóir thú a chur ar an eolas i scríbhinn faoi roghanna eile, lena n-áirítear géilleadh deonach, trádáil aníos nó díol deonach, agus na himpleachtaí a bheidh i gceist le gach ceann díobh seo

source: They must also inform you that you are now outside the MARP, and that repossession proceedings can follow after 3 months – see 'Repossession proceedings' below
ga: Anuas air sin, ní mór dóibh thú a chur ar an eolas go bhfuil tú anois lasmuigh den PRRM, agus go bhféadfadh imeachtaí athshealbhaithe tosú tar éis trí mhí – féach ‘Imeachtaí athshealbhaithe’ thíos

source: The lender must also tell you what happens about any debt outstanding after repossession or sale
ga: Ní mór don iasachtóir insint duit, chomh maith, céard a tharlaíonn le haon fhiachas atá fós le híoc tar éis athshealbhú nó díola

source: It must tell you about personal insolvency options; the importance of taking independent advice; and your right to appeal or complain
ga: Sa bhreis air sin, ní mór dóibh thú a chur ar an eolas faoi roghanna um dhócmhainneacht phearsanta; an tábhacht a bhaineann le comhairle neamhspleách a fháil; agus an ceart atá agat chun achomharc nó gearán a dhéanamh

source: If you have worked through the MARP with your lender and agree that you can no longer afford to pay your mortgage loan now or in the future, the lender may approve you for the national mortgage-to-rent scheme, depending on your circumstances. Under this scheme, people who cannot pay their mortgage can switch from owning their home to renting their home as social tenants of a housing association, which buys the home from the lender
ga: Má stadann tú ag cloí le téarmaí aisíocaíochta ar shocrú malartach, ní mór don Aonad Tacaíochta Riaráistí an iasachtóra athbhreithniú foirmiúil a dhéanamh ar do chás, lena n-áirítear an ráiteas airgeadais caighdeánach, láithreach

source: Under the revised CCMA effective from July 2013, the appeals process is now separate from the MARP
ga: Faoin CIRM atá éifeachtach ó Iúil 2013, próiseas ar leith é an próiseas achomhairc amach ón bPróiseas Réitigh Riaráistí Morgáiste (PRRM)

source: However, if you are refused an alternative repayment arrangement, or you reject the arrangement being offered, you must get 3 months before the lender can start repossession proceedings – see 'Repossession proceedings' below
ga: Má dhiúltaítear socrú eile aisíocaíochta duit, áfach, nó mura nglacann tú leis an socrú atá á ofráil, ní mór go dtabharfar trí mhí duit sular féidir leis an iasachtóir tús a chur le himeachtaí athshealbhaithe – féach ‘Imeachtaí athshealbhaithe’ thíos

source: Even though you are now outside the MARP, you can appeal the decision to the lender’s Appeals Board under the CCMA if:
ga: Cé go bhfuil tú anois lasmuigh den PRRM, féadfaidh tú an cinneadh achomharc le Bord Achomhairc an iasachtóra faoin CIRM

source: • You are not willing to accept the alternative repayment arrangement being offered
ga: • Mura bhfuil tú toilteanach glacadh leis an socrú eile aisíoctha atá á ofráil duit

source: • You are not offered an alternative arrangement
ga: • Mura n-ofráiltear socrú eile duit

source: • You are classified as not co-operating
ga: • Rangaítear thú amhail gan bheith ag comhoibriú

source: The lender must allow you a reasonable period to consider submitting an appeal
ga: Ní mór don iasachtóir tréimhse réasúnta a thabhairt duit chun machnamh ar achomharc a sheoladh ar aghaidh

source: This must be at least 20 business days from the date you receive notification of the ASU’s decision
ga: Ní mór go dtabharfar ar a laghad 20 lá gnó duit ón dáta a fhaigheann tú fógra ar chinneadh an ATR

source: The Appeals Board will be made up of 3 of the lender’s senior personnel who have not yet been involved in your case
ga: Beidh triúr pearsanra den iasachtóir sa Bhord Achomhairc nach raibh baint acu i do chás go fóill

source: At least one member of the Appeals Board must be independent of the management team and must not be involved in lending matters
ga: Ní mór go mbeidh ar a laghad comhalta amháin den Bhord Achomhairc neamhspleách ar an bhfoireann bhainistíochta agus ní mór go mbeidh baint acu i gceisteanna iasachta
